Infineon/src-trusted-firmware-m/platform/ext/target/cypress/psoc64/target_cfg.c
/*
 * Copyright (c) 2018 Arm Limited
 * Copyright (c) 2019-2022 Cypress Semiconductor Corporation (an Infineon company)
 * or an affiliate of Cypress Semiconductor Corporation. All rights reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include <inttypes.h>

#include "cy_prot.h"
#include "cy_gpio.h"
#include "cy_sysclk.h"
#include "device_definition.h"
#include "driver_ppu.h"
#include "driver_smpu.h"
#include "images.h"
#include "pc_config.h"
#include "platform_description.h"
#include "region.h"
#include "region_defs.h"
#include "RTE_Device.h"
#include "target_cfg.h"
#include "tfm_plat_defs.h"
#include "tfm_spm_log.h"
#include "utils/cy_policy.h"
#include "static_checks.h"


/* Merge note: Do not define memory_regions structure values.
 * Call populate_memory_regions()::tfm_nspe_flash_block()
 * to get memory_regions information
 */
struct memory_region_limits memory_regions;
struct policy_hw_settings hw_settings;

/* UART RX and TX pins */
const cy_stc_gpio_pin_config_t CYBSP_UART_RX_config =
{
    .outVal = 1,
    .driveMode = CY_GPIO_DM_HIGHZ,
    .hsiom = CYBSP_UART_RX_HSIOM,
    .intEdge = CY_GPIO_INTR_DISABLE,
    .intMask = 0UL,
    .vtrip = CY_GPIO_VTRIP_CMOS,
    .slewRate = CY_GPIO_SLEW_FAST,
    .driveSel = CY_GPIO_DRIVE_1_2,
    .vregEn = 0UL,
    .ibufMode = 0UL,
    .vtripSel = 0UL,
    .vrefSel = 0UL,
    .vohSel = 0UL,
};
#if defined (CY_USING_HAL)
const cyhal_resource_inst_t CYBSP_UART_RX_obj =
{
    .type = CYHAL_RSC_GPIO,
    .block_num = CYBSP_UART_RX_PORT_NUM,
    .channel_num = CYBSP_UART_RX_PIN,
};
#endif /* defined (CY_USING_HAL) */
const cy_stc_gpio_pin_config_t CYBSP_UART_TX_config =
{
    .outVal = 1,
    .driveMode = CY_GPIO_DM_STRONG_IN_OFF,
    .hsiom = CYBSP_UART_TX_HSIOM,
    .intEdge = CY_GPIO_INTR_DISABLE,
    .intMask = 0UL,
    .vtrip = CY_GPIO_VTRIP_CMOS,
    .slewRate = CY_GPIO_SLEW_FAST,
    .driveSel = CY_GPIO_DRIVE_1_2,
    .vregEn = 0UL,
    .ibufMode = 0UL,
    .vtripSel = 0UL,
    .vrefSel = 0UL,
    .vohSel = 0UL,
};
#if defined (CY_USING_HAL)
const cyhal_resource_inst_t CYBSP_UART_TX_obj =
{
    .type = CYHAL_RSC_GPIO,
    .block_num = CYBSP_UART_TX_PORT_NUM,
    .channel_num = CYBSP_UART_TX_PIN,
};
#endif /* defined (CY_USING_HAL) */

static void populate_memory_regions(void)
{
    uint32_t nspe_base;
    size_t nspe_size;

    tfm_nspe_flash_block(&nspe_base, &nspe_size);
    TFM_COVERITY_DEVIATE_LINE(cert_int30_c, "NSPE address is a constant or taken from a policy that is validated before provisioning")
    memory_regions.non_secure_code_start = nspe_base + CYBL_HEADER_SIZE;
    memory_regions.non_secure_partition_base = nspe_base;
    TFM_COVERITY_DEVIATE_LINE(cert_int30_c, "NSPE address and size are constants or taken from a policy that is validated before provisioning")
    memory_regions.non_secure_partition_limit = nspe_base + nspe_size - 1;
}

/* To write into AIRCR register, 0x5FA value must be write to the VECTKEY field,
 * otherwise the processor ignores the write.
 */
#define SCB_AIRCR_WRITE_MASK ((0x5FAUL << SCB_AIRCR_VECTKEY_Pos))

struct platform_data_t tfm_peripheral_std_uart = {
        SCB5_BASE,
        SCB5_BASE + 0xFFF,
        -1,
        -1
};

struct platform_data_t tfm_peripheral_timer0 = {
        TCPWM0_BASE,
        TCPWM0_BASE + (sizeof(TCPWM_Type) - 1),
        -1,
        -1
};

void enable_fault_handlers(void)
{
    /* Fault handles enable registers are not present in Cortex-M0+ */
}

void system_reset_cfg(void)
{
    uint32_t reg_value = SCB->AIRCR;

    /* Clear SCB_AIRCR_VECTKEY value */
    reg_value &= ~(uint32_t)(SCB_AIRCR_VECTKEY_Msk);

    /* Set Access Key (0x05FA must be written to this field) */
    reg_value |= (uint32_t)(SCB_AIRCR_WRITE_MASK);

    SCB->AIRCR = reg_value;
}

static const cy_stc_fll_manual_config_t srss_0_clock_0_fll_0_fllConfig =
{
    .fllMult = 500U,
    .refDiv = 20U,
    .ccoRange = CY_SYSCLK_FLL_CCO_RANGE4,
    .enableOutputDiv = true,
    .lockTolerance = 10U,
    .igain = 9U,
    .pgain = 5U,
    .settlingCount = 8U,
    .outputMode = CY_SYSCLK_FLLPLL_OUTPUT_OUTPUT,
    .cco_Freq = 355U,
};

extern void Cy_Platform_Init(void);
void platform_init(void)
{
    cy_en_sysclk_status_t clk_rc;
#ifdef TFM_ENABLE_IRQ_TEST
    cy_en_sysint_status_t int_rc;
#endif
#ifdef CY_HW_SETTINGS_FROM_POLICY
    /* populate hw_settings structure from policy*/
    cy_get_policy_hw_settings(&hw_settings);
#else
    hw_settings.uart_base = SCB5_BASE,
    hw_settings.uart_enabled = true,
#endif

    Cy_PDL_Init(CY_DEVICE_CFG);

    Cy_SysLib_SetWaitStates(false, 150UL);
    Cy_SysClk_FllManualConfigure(&srss_0_clock_0_fll_0_fllConfig);
    Cy_SysClk_FllEnable(200000UL);

    /* UART clock */
    clk_rc = Cy_SysClk_PeriphDisableDivider(CY_SYSCLK_DIV_8_BIT, 1U);
    if (clk_rc != CY_SYSCLK_SUCCESS) {
        SPMLOG_INFMSG("WARNING: Failed to configure UART clock\r\n");
    }
    clk_rc = Cy_SysClk_PeriphSetDivider(CY_SYSCLK_DIV_8_BIT, 1U, 108U);
    if (clk_rc != CY_SYSCLK_SUCCESS) {
        SPMLOG_INFMSG("WARNING: Failed to configure UART clock\r\n");
    }
    clk_rc = Cy_SysClk_PeriphEnableDivider(CY_SYSCLK_DIV_8_BIT, 1U);
    if (clk_rc != CY_SYSCLK_SUCCESS) {
        SPMLOG_INFMSG("WARNING: Failed to configure UART clock\r\n");
    }
    if(hw_settings.uart_enabled) {
        clk_rc = Cy_SysClk_PeriphAssignDivider(PCLK_SCB5_CLOCK, CY_SYSCLK_DIV_8_BIT, 1U);
        if (clk_rc != CY_SYSCLK_SUCCESS) {
            SPMLOG_INFMSG("WARNING: Failed to configure UART clock\r\n");
        }
    }
    /* Secure: TIMER0 clock */
    clk_rc = Cy_SysClk_PeriphAssignDivider(PCLK_TCPWM0_CLOCKS0, CY_SYSCLK_DIV_8_BIT, 1U);
    if (clk_rc != CY_SYSCLK_SUCCESS) {
        SPMLOG_INFMSG("WARNING: Failed to configure timer0 clock\r\n");
    }
    /* Non-Secure: TIMER1 clock */
    clk_rc = Cy_SysClk_PeriphAssignDivider(PCLK_TCPWM0_CLOCKS1, CY_SYSCLK_DIV_8_BIT, 1U);
    if (clk_rc != CY_SYSCLK_SUCCESS) {
        SPMLOG_INFMSG("WARNING: Failed to configure timer1 clock\r\n");
    }

    /* UART pins */
    if(hw_settings.uart_enabled)
    {
        Cy_GPIO_Pin_Init(CYBSP_UART_RX_PORT, CYBSP_UART_RX_PIN, &CYBSP_UART_RX_config);
    #if defined (CY_USING_HAL)
        cyhal_hwmgr_reserve(&CYBSP_UART_RX_obj);
    #endif /* defined (CY_USING_HAL) */

        Cy_GPIO_Pin_Init(CYBSP_UART_TX_PORT, CYBSP_UART_TX_PIN, &CYBSP_UART_TX_config);
    #if defined (CY_USING_HAL)
        cyhal_hwmgr_reserve(&CYBSP_UART_TX_obj);
    #endif /* defined (CY_USING_HAL) */
    }

    Cy_Platform_Init();

    populate_memory_regions();

#ifdef TFM_ENABLE_IRQ_TEST
    int_rc = Cy_SysInt_Init(&CY_TCPWM_NVIC_CFG_S, TFM_TIMER0_IRQ_Handler);
    if (int_rc != CY_SYSINT_SUCCESS) {
        SPMLOG_INFMSG("WARNING: Fail to initialize timer interrupt (IRQ TEST might fail)!\r\n");
    }
#endif /* TFM_ENABLE_IRQ_TEST */

