Infineon/src-trusted-firmware-m/platform/ext/target/cypress/psoc64/target_cfg.c
    /* make sure CM4 is disabled */
    if (CY_SYS_CM4_STATUS_ENABLED == Cy_SysGetCM4Status()) {
        Cy_SysDisableCM4();
    }
}

enum tfm_plat_err_t nvic_interrupt_target_state_cfg(void)
{
    return TFM_PLAT_ERR_SUCCESS;
}

enum tfm_plat_err_t nvic_interrupt_enable(void)
{
    /* PPU and SMPU don't generate interrupts.
     * USART and Flash drivers don't export an EnableInterrupt function.
     * So there's nothing to do here.
     */
    return TFM_PLAT_ERR_SUCCESS;
}

enum tfm_plat_err_t bus_masters_cfg(void)
{
    /* Cortex-M4 - PC=6 */
    if (Cy_Prot_SetActivePC(CPUSS_MS_ID_CM4,
                            CY_PROT_HOST_DEFAULT) != CY_PROT_SUCCESS) {
        return TFM_PLAT_ERR_SYSTEM_ERR;
    }

    /* Test Controller - PC=7 */
    if (Cy_Prot_SetActivePC(CPUSS_MS_ID_TC, CY_PROT_TC) != CY_PROT_SUCCESS) {
        return TFM_PLAT_ERR_SYSTEM_ERR;
    }

    /* Cortex-M0+ - PC=1 */
    if (Cy_Prot_SetActivePC(CPUSS_MS_ID_CM0,
                            CY_PROT_SPM_DEFAULT) != CY_PROT_SUCCESS) {
        return TFM_PLAT_ERR_SYSTEM_ERR;
    }

    return TFM_PLAT_ERR_SUCCESS;
}

const SMPU_Resources *smpu_init_table[] = {
#if RTE_SMPU0
    &SMPU0_Resources,
#endif

#if RTE_SMPU1
    &SMPU1_Resources,
#endif

#if RTE_SMPU2
    &SMPU2_Resources,
#endif

#if RTE_SMPU3
    &SMPU3_Resources,
#endif

#if RTE_SMPU4
    &SMPU4_Resources,
#endif

#if RTE_SMPU5
    &SMPU5_Resources,
#endif

#if RTE_SMPU6
    &SMPU6_Resources,
#endif

#if RTE_SMPU7
    &SMPU7_Resources,
#endif

#if RTE_SMPU8
    &SMPU8_Resources,
#endif

#if RTE_SMPU9
    &SMPU9_Resources,
#endif

#if RTE_SMPU10
    &SMPU10_Resources,
#endif

#if RTE_SMPU11
    &SMPU11_Resources,
#endif

#if RTE_SMPU12
    &SMPU12_Resources,
#endif

#if RTE_SMPU13
    &SMPU13_Resources,
#endif
};

enum tfm_plat_err_t smpu_init_cfg(void)
{
    enum tfm_plat_err_t ret = TFM_PLAT_ERR_SUCCESS;

    size_t n = sizeof(smpu_init_table)/sizeof(smpu_init_table[0]);

    for (int i = (n - 1); i >= 0; i--)
    {
        if (SMPU_Configure(smpu_init_table[i]) != CY_PROT_SUCCESS) {
            ret = TFM_PLAT_ERR_SYSTEM_ERR;
        }
    }

    /* Now protect all unconfigured SMPUs */
    if (protect_unconfigured_smpus() != CY_PROT_SUCCESS) {
        ret = TFM_PLAT_ERR_SYSTEM_ERR;
    }

    __DSB();
    __ISB();

    return ret;
}

void smpu_print_config(void)
{
    SPMLOG_INFMSG("\r\nSMPU config:\r\n");
    SPMLOG_INFMSGVAL("memory_regions.non_secure_code_start = ",
            memory_regions.non_secure_code_start);
    SPMLOG_INFMSGVAL("memory_regions.non_secure_partition_base = ",
            memory_regions.non_secure_partition_base);
    SPMLOG_INFMSGVAL("memory_regions.non_secure_partition_limit = ",
            memory_regions.non_secure_partition_limit);

    size_t n = sizeof(smpu_init_table)/sizeof(smpu_init_table[0]);

    for (size_t i = 0; i < n; i++)
    {
        SMPU_Print_Config(smpu_init_table[i]);
    }
}

const PPU_Resources *ppu_init_table[] = {
#if RTE_MS_PPU_PR7
&PR7_PPU_Resources,
#endif
#if RTE_MS_PPU_PERI_MAIN
    &PERI_MAIN_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_GR0_GROUP
    &PERI_GR0_GROUP_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_GR1_GROUP
    &PERI_GR1_GROUP_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_GR2_GROUP
    &PERI_GR2_GROUP_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_GR3_GROUP
    &PERI_GR3_GROUP_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_GR4_GROUP
    &PERI_GR4_GROUP_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_GR6_GROUP
    &PERI_GR6_GROUP_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_GR9_GROUP
    &PERI_GR9_GROUP_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_GR10_GROUP
    &PERI_GR10_GROUP_PPU_Resources,
#endif

#if RTE_MS_PPU_PERI_TR
    &PERI_TR_PPU_Resources,
#endif

#if RTE_MS_PPU_CRYPTO_MAIN
    &CRYPTO_MAIN_PPU_Resources,
#endif

#if RTE_MS_PPU_CRYPTO_CRYPTO
    &CRYPTO_CRYPTO_PPU_Resources,
#endif

#if RTE_MS_PPU_CRYPTO_BOOT
    &CRYPTO_BOOT_PPU_Resources,
#endif

#if RTE_MS_PPU_CRYPTO_KEY0
    &CRYPTO_KEY0_PPU_Resources,
#endif

#if RTE_MS_PPU_CRYPTO_KEY1
    &CRYPTO_KEY1_PPU_Resources,
#endif

#if RTE_MS_PPU_CRYPTO_BUF
    &CRYPTO_BUF_PPU_Resources,
#endif

#if RTE_MS_PPU_CPUSS_CM4
    &CPUSS_CM4_PPU_Resources,
#endif

#if RTE_MS_PPU_CPUSS_CM0
    &CPUSS_CM0_PPU_Resources,
#endif

#if RTE_MS_PPU_CPUSS_BOOT
    &CPUSS_BOOT_PPU_Resources,
#endif

#if RTE_MS_PPU_CPUSS_CM0_INT
    &CPUSS_CM0_INT_PPU_Resources,
#endif

#if RTE_MS_PPU_CPUSS_CM4_INT
    &CPUSS_CM4_INT_PPU_Resources,
#endif

#if RTE_MS_PPU_FAULT_STRUCT0_MAIN
    &FAULT_STRUCT0_MAIN_PPU_Resources,
#endif

#if RTE_MS_PPU_FAULT_STRUCT1_MAIN
    &FAULT_STRUCT1_MAIN_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT0_IPC
    &IPC_STRUCT0_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT1_IPC
    &IPC_STRUCT1_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT2_IPC
    &IPC_STRUCT2_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT3_IPC
    &IPC_STRUCT3_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT4_IPC
    &IPC_STRUCT4_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT5_IPC
    &IPC_STRUCT5_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT6_IPC
    &IPC_STRUCT6_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT7_IPC
    &IPC_STRUCT7_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT8_IPC
    &IPC_STRUCT8_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT9_IPC
    &IPC_STRUCT9_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT10_IPC
    &IPC_STRUCT10_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT11_IPC
    &IPC_STRUCT11_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT12_IPC
    &IPC_STRUCT12_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT13_IPC
    &IPC_STRUCT13_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT14_IPC
    &IPC_STRUCT14_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_STRUCT15_IPC
    &IPC_STRUCT15_IPC_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT0_INTR
    &IPC_INTR_STRUCT0_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT1_INTR
    &IPC_INTR_STRUCT1_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT2_INTR
    &IPC_INTR_STRUCT2_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT3_INTR
    &IPC_INTR_STRUCT3_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT4_INTR
    &IPC_INTR_STRUCT4_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT5_INTR
    &IPC_INTR_STRUCT5_INTR_PPU_Resources,
#endif

#if RTE_MS_PPU_IPC_INTR_STRUCT6_INTR
    &IPC_INTR_STRUCT6_INTR_PPU_Resources,
#endif

