Infineon/src-trusted-firmware-m/platform/ext/target/cypress/psoc64/target_cfg.c
#if RTE_MS_PPU_DW1_CH_STRUCT10_CH
    &DW1_CH_STRUCT10_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT11_CH
    &DW1_CH_STRUCT11_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT12_CH
    &DW1_CH_STRUCT12_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT13_CH
    &DW1_CH_STRUCT13_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT14_CH
    &DW1_CH_STRUCT14_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT15_CH
    &DW1_CH_STRUCT15_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT16_CH
    &DW1_CH_STRUCT16_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT17_CH
    &DW1_CH_STRUCT17_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT18_CH
    &DW1_CH_STRUCT18_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT19_CH
    &DW1_CH_STRUCT19_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT20_CH
    &DW1_CH_STRUCT20_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT21_CH
    &DW1_CH_STRUCT21_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT22_CH
    &DW1_CH_STRUCT22_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT23_CH
    &DW1_CH_STRUCT23_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT24_CH
    &DW1_CH_STRUCT24_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT25_CH
    &DW1_CH_STRUCT25_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT26_CH
    &DW1_CH_STRUCT26_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT27_CH
    &DW1_CH_STRUCT27_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DW1_CH_STRUCT28_CH
    &DW1_CH_STRUCT28_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DMAC_TOP
    &DMAC_TOP_PPU_Resources,
#endif

#if RTE_MS_PPU_DMAC_CH0_CH
    &DMAC_CH0_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DMAC_CH1_CH
    &DMAC_CH1_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DMAC_CH2_CH
    &DMAC_CH2_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_DMAC_CH3_CH
    &DMAC_CH3_CH_PPU_Resources,
#endif

#if RTE_MS_PPU_EFUSE_CTL
    &EFUSE_CTL_PPU_Resources,
#endif

#if RTE_MS_PPU_EFUSE_DATA
    &EFUSE_DATA_PPU_Resources,
#endif

#if RTE_MS_PPU_PROFILE
    &PROFILE_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_PRT0_PRT
    &HSIOM_PRT0_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_PRT1_PRT
    &HSIOM_PRT1_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_PRT2_PRT
    &HSIOM_PRT2_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_PRT3_PRT
    &HSIOM_PRT3_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_PRT4_PRT
    &HSIOM_PRT4_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_PRT5_PRT
    &HSIOM_PRT5_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_PRT6_PRT
    &HSIOM_PRT6_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_PRT7_PRT
    &HSIOM_PRT7_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_PRT8_PRT
    &HSIOM_PRT8_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_PRT9_PRT
    &HSIOM_PRT9_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_PRT10_PRT
    &HSIOM_PRT10_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_PRT11_PRT
    &HSIOM_PRT11_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_PRT12_PRT
    &HSIOM_PRT12_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_PRT13_PRT
    &HSIOM_PRT13_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_PRT14_PRT
    &HSIOM_PRT14_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_AMUX
    &HSIOM_AMUX_PPU_Resources,
#endif

#if RTE_MS_PPU_HSIOM_MON
    &HSIOM_MON_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT0_PRT
    &GPIO_PRT0_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT1_PRT
    &GPIO_PRT1_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT2_PRT
    &GPIO_PRT2_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT3_PRT
    &GPIO_PRT3_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT4_PRT
    &GPIO_PRT4_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT5_PRT
    &GPIO_PRT5_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT6_PRT
    &GPIO_PRT6_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT7_PRT
    &GPIO_PRT7_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT8_PRT
    &GPIO_PRT8_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT9_PRT
    &GPIO_PRT9_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT10_PRT
    &GPIO_PRT10_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT11_PRT
    &GPIO_PRT11_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT12_PRT
    &GPIO_PRT12_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT13_PRT
    &GPIO_PRT13_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT14_PRT
    &GPIO_PRT14_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT0_CFG
    &GPIO_PRT0_CFG_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT1_CFG
    &GPIO_PRT1_CFG_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT2_CFG
    &GPIO_PRT2_CFG_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT3_CFG
    &GPIO_PRT3_CFG_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT4_CFG
    &GPIO_PRT4_CFG_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT5_CFG
    &GPIO_PRT5_CFG_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT6_CFG
    &GPIO_PRT6_CFG_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT7_CFG
    &GPIO_PRT7_CFG_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT8_CFG
    &GPIO_PRT8_CFG_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT9_CFG
    &GPIO_PRT9_CFG_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT10_CFG
    &GPIO_PRT10_CFG_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT11_CFG
    &GPIO_PRT11_CFG_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT12_CFG
    &GPIO_PRT12_CFG_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT13_CFG
    &GPIO_PRT13_CFG_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_PRT14_CFG
    &GPIO_PRT14_CFG_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_GPIO
    &GPIO_GPIO_PPU_Resources,
#endif

#if RTE_MS_PPU_GPIO_TEST
    &GPIO_TEST_PPU_Resources,
#endif

#if RTE_MS_PPU_SMARTIO_PRT8_PRT
    &SMARTIO_PRT8_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_SMARTIO_PRT9_PRT
    &SMARTIO_PRT9_PRT_PPU_Resources,
#endif

#if RTE_MS_PPU_LPCOMP
    &LPCOMP_PPU_Resources,
#endif

#if RTE_MS_PPU_CSD0
    &CSD0_PPU_Resources,
#endif

#if RTE_MS_PPU_TCPWM0
    &TCPWM0_PPU_Resources,
#endif

#if RTE_MS_PPU_TCPWM1
    &TCPWM1_PPU_Resources,
#endif

#if RTE_MS_PPU_LCD0
    &LCD0_PPU_Resources,
#endif

#if RTE_MS_PPU_USBFS0
    &USBFS0_PPU_Resources,
#endif

#if RTE_MS_PPU_SMIF0
    &SMIF0_PPU_Resources,
#endif

#if RTE_MS_PPU_SDHC0
    &SDHC0_PPU_Resources,
#endif

#if RTE_MS_PPU_SDHC1
    &SDHC1_PPU_Resources,
#endif

#if RTE_MS_PPU_SCB0
    &SCB0_PPU_Resources,
#endif

#if RTE_MS_PPU_SCB1
    &SCB1_PPU_Resources,
#endif

#if RTE_MS_PPU_SCB2
    &SCB2_PPU_Resources,
#endif

#if RTE_MS_PPU_SCB3
    &SCB3_PPU_Resources,
#endif

#if RTE_MS_PPU_SCB4
    &SCB4_PPU_Resources,
#endif

#if RTE_MS_PPU_SCB5
    &SCB5_PPU_Resources,
#endif

#if RTE_MS_PPU_SCB6
    &SCB6_PPU_Resources,
#endif

#if RTE_MS_PPU_SCB7
    &SCB7_PPU_Resources,
#endif

#if RTE_MS_PPU_SCB8
    &SCB8_PPU_Resources,
#endif

#if RTE_MS_PPU_SCB9
    &SCB9_PPU_Resources,
#endif

#if RTE_MS_PPU_SCB10
    &SCB10_PPU_Resources,
#endif

#if RTE_MS_PPU_SCB11
    &SCB11_PPU_Resources,
#endif

#if RTE_MS_PPU_SCB12
    &SCB12_PPU_Resources,
#endif

#if RTE_MS_PPU_PDM0
    &PDM0_PPU_Resources,
#endif

#if RTE_MS_PPU_I2S0
    &I2S0_PPU_Resources,
#endif

#if RTE_MS_PPU_I2S1
    &I2S1_PPU_Resources,
#endif
};

enum tfm_plat_err_t ppu_init_cfg(void)
{
    enum tfm_plat_err_t ret = TFM_PLAT_ERR_SUCCESS;

    size_t n = sizeof(ppu_init_table)/sizeof(ppu_init_table[0]);

    for (size_t i = 0; i < n; i++)
    {
        if (PPU_Configure(ppu_init_table[i]) != CY_PROT_SUCCESS) {
            ret = TFM_PLAT_ERR_SYSTEM_ERR;
        }
    }

    __DSB();
    __ISB();

    return ret;
}
